label day1_scene1:
    scene schoolclass with fade
    "Я снова прихожу в школу. Каждый день здесь становится для меня испытанием. Садясь за свою парту, я невольно слышу тихие перешёптывания, которые отдаются громким эхом в моей голове."
    boy3 "Вот он, Алекс, самый умник..."
    boy4 "Сидит и молчит вечно, придурок."
    "Я притворяюсь, что не слышу эти слова и сосредотачиваюсь на уроке. Учительница раздает задание, и, как обычно, мои одноклассники с презрением следят за тем, как мне вручают отдельные и более сложные задачи."
    "Перешёптывания только усиливаются, но я уже не слушаю. Я и так знаю всё, что они говорят обо мне. Странный и тихий - ещё самое мягкое, что они говорят."
    boy5 "Да он что, самый умный?"
    "Учительнице будто бы всё равно."
    "Я всегда преуспевал в учёбе и Ричард настаивает на особенно сложных заданиях для меня."
    scene schoolhall with fade
    "Одинокий в школе, я чувствую себя чужаком среди шума и смеха моих одноклассников. Пока они завязывают дружеские отношения и обмениваются шутками, я остаюсь в стороне, мечтая хотя бы об одном настоящем друге."
    "Учителя стараются поощрять сотрудничество, но никто не выбирает меня в качестве партнера. Книги становятся моими спутниками, предлагая временное утешение."
    "Когда я иду домой, я цепляюсь за надежду, что однажды я найду свое место и настоящую связь с другими. Но пока я терплю, зная, что моя ценность определяется не количеством друзей, которые у меня есть."
    "Никто не сядет со странным Алексом."
    jump night1_scene1