label day2_scene1:
    scene room with dissolve
    "На следующее утро Ричард открыл шкаф."
    richard "Ты усвоил урок, Алекс?"
    alex "Да."
    "Он кивает мне, успокоенный осознанием того, что его учение приносит плоды, и даже хлопает по плечу, прежде чем тот выходит из комнаты."
    "Уходя, он забирает ключ с собой. Дверцы шкафа остаются незапертыми."
    "Большие глаза смотрят на него."
    "Михаил очень симпатичный."
    alex "Теперь можешь выходить."
    misha "Спасибо, Лекси. Нам будет так весело."
    "Он тепло улыбается, и я не мог не чувствовать благодарности за его присутствие."
    "Михаил был таким общительным, полная противоположность моему тихому и скромному поведению. Он даже сказал, что съест ради меня острую пищу, которую я плохо перевариваю."
    alex "Спасибо, Михаил, но я не думаю, что в этом есть необходимость."
    misha "О, да ладно, это будет настоящее приключение! У нас все получится."
    "Несмотря на его рвение, я знал, что у меня есть более неотложные дела, требующие внимания. Я взглянул на стол, заваленный домашними заданиями."
    "Мне всегда доставались особо сложные задания."
    "С другой стороны, у меня была своя комната, и хотелось показать Михаилу, как она выглядит и исследовать ее тайны."
    menu:  
        "У меня куча домашки, поможешь?":
            jump day2_scene2_1
        "Я хочу тебе кое-что показать.":
            jump day2_scene2_2

label day2_scene2_1:
    scene studyroom with dissolve
    "Комната мягко освещена, а атмосфера уютная и комфортная. Алекс сидит за своим столом, окруженный книгами, и выглядит сосредоточенным, но немного напряженным."
    "Майкл растянулся на кровати, подбрасывая в воздух мяч для снятия стресса и с энтузиазмом ловя его. На его лице дерзкая ухмылка, он готов погрузиться в домашнее задание."
    alex "Спасибо, что ты здесь, Михаил."
    misha "Не волнуйся, Лекси! Мы вместе справимся с этим домашним заданием!"
    "Алекс начинает работать над математической задачей, без особых усилий записывая уравнения и решения. Михаил наблюдает за этим с благоговейным трепетом."
    misha "Ты прямо математический гений! Держу пари, ты мог бы объяснить мне все это, даже не вспотев."
    alex "*стесняясь* На самом деле, в этом нет ничего особенного. Я просто нахожу это интересным."
    "Немного напрягаюсь, не понимая слёту, как подойти к этой задаче. Кажется, Михаил замечает легкое напряжение в поведении Алекса."
    misha "Эй, не волнуйся, Лекси. Ты великолепен, и я верю в тебя."
    "Я благодарно улыбается, чувствуя себя увереннее от слов Михаила."
    misha "Ладно, хватит серьезности! Давайте приступим к приготовлению пищи для мозга!"
    "Майкл хватает со стола пакетик обычных картофельных чипсов и начинает с аппетитом их жевать."
    misha "Ммм, чипсы! Вам обязательно стоит побаловать себя чем-нибудь из этого. В них секрет сосредоточенности гениального уровня!"
    "Легко хихикаю и качаю головой."
    alex "Если бы только это было так просто, Михаил."
    "Мы возвращаемся к домашнему заданию, и я уверенно объясняю всё Михаилу, когда у него возникают вопросы."
    "Михаил внимательно слушает и время от времени вставляет беззаботный комментарий или шутку, чтобы поддержать хорошее настроение."
    misha "Ты молодец, Алекс! Твоё понимание этого всего поразительно."
    "Напряжение спадает все больше и больше. Появляется и укрепляется удовольствие от процесса при неизменной поддержке Михаила."
    misha "Какой умница, Лекси! Продолжай в том же духе!"
    alex "Спасибо, Михаил. Я действительно ценю, что ты здесь, со мной."
    "Мы работаем вместе еще некоторое время, и когда задание подходит к концу, я могу испытать чувство выполненного долга."
    misha "Ты звезда!"
    alex "Мы сделали это, Михаил. Спасибо."
    "Михаил мягко улыбается в ответ, довольный тем, что стал источником поддержки для своего друга. Мы продолжаем наслаждаться обществом друг друга, заканчивая домашнее задание."
    jump day2_scene3

label day2_scene2_2:
    scene studyroom with dissolve
    misha "Ура! Давай сделаем это!"
    "Комната была простой и опрятной, как и весь остальной дом. Здесь не было ни игрушек, ни ярких красок, ни книжек с картинками, украшавших полки."
    "С левой стороны находилась книжная полка, выглядевшая довольно пустой, если не считать трех книг."
    "Два романа классической литературы и один сборник стихов, а также маленькая изящная хрустальная статуэтка."
    "Он казался мне отражением меня самого — тихого, сдержанного и любящего книги."
    alex "Эти книги... от Ричарда. Он поощряет меня читать и учиться."
    misha "А как насчет статуэтки? Красивая!"
    alex "Да, это подарок на память от моих настоящих родителей. Я их не помню, но это единственное, что они оставили после себя."
    "Я достал одну из книг, намереваясь прочитать Михаилу мой любимый момент."
    "Когда когда я открыл ее, произошло нечто странное. Текст на страницах превратился в жуткие, почти демонические символы."
    alex "Ч-что...?"
    "Я моргнул, и внезапно текст вернулся к своему обычному виду. Теперь книга выглядела как любой другой классический роман."
    misha "Ты это видел? Должно быть, это твое воображение играет!"
    alex "Да, возможно..."
    "Двигаясь дальше я показал Михаилу маленький письменный стол, спрятанный в углу. В нем лежало несколько карандашей, чернильница и немного пергамента."
    "Письменный стол, казалось, манил меня, приглашая выразить себя письменно."
    misha "О, тебе обязательно нужно что-нибудь написать! Позволь своим мыслям излиться на бумагу!"
    alex "Я не уверен, о чем писать..."
    misha "Как насчет чего-нибудь волшебного? Знаешь, как в сказке о волшебниках, драконах и прочей классной чепухе!"
    alex "Это действительно звучит забавно. Может быть, я как-нибудь попробую это сделать."
    "Наше исследование привело нас к окну, через которое проникал мягкий утренний свет. Я выглянул наружу и на мгновение позволила себе представить, какой могла бы быть моя жизнь."
    misha "У тебя все получится, Алекс. Просто будь собой."
    alex "Спасибо, Михаил."
    jump night2_scene1

    