label night3_scene1:
    scene principalroom
    "Я нервно вошел в кабинет директрисы, мое сердце бешено колотилось в груди."
    prin "Человек, который хочет вас усыновить, очень богат и будет возлагать на тебя очень большие надежды."
    prin "Он видел твои работы и приз, который ты выиграл на окружном научном конкурсе, и он захочет, чтобы ты преуспел, воспользовавшись возможностями, которые он может предоставить."
    "Я внимательно слушал, впитывая каждое слово."
    prin "Это очень великодушно с его стороны - открыть для тебя свой дом из-за твоего потенциала, и поэтому важно, чтобы ты показал ему, что ты благодарен."
    "Благодарность."
    "Это слово глубоко задело меня."
    "Я так долго мечтал о семье, и теперь кто-то захотел взять меня к себе, стать моим родителем. Эта мысль наполнила меня одновременно волнением и трепетом."
    "Может быть, если я действительно буду хорошим — если я буду достаточно умным, милым и воспитанным, - он когда-нибудь захочет стать моим родителем."
    "Он хочет, чтобы я называл его \"отец\", и он хочет, чтобы меня знали как его сына."
    "Настоящий дом, настоящая семья – это было почти слишком хорошо, чтобы быть правдой."
    "Но страх разочарования остался где-то на задворках моего сознания."
    "Что, если я не смогу оправдать его ожиданий?"
    "Что, если я недостаточно хорош?"
    "Но я должен попытаться. "
    "Я покажу ему, что достоин этой возможности, что я могу быть таким сыном, какого он хотел."
    jump night3_scene2

label night3_scene2:
    scene darkroom
    misha "Все в порядке, Лекси?"
    "Почему-то я не могу заставить себя говорить и просто киваю."
    misha "Хочешь, я возьму тебя за руку?"
    "Я вновь киваю."
    "Рука Михаила сухая и мягкая, и немного больше, чем моя."
    "Мое дыхание начинает замедляться, и с этой успокаивающей точкой соприкосновения я чувствую, как его измученное тело снова погружается в объятия сна."
    alex "Ты мне очень нравишься, Михаил."
    misha "…"
    scene black with fade
    misha "Ты мне тоже нравишься, Алекс."
    jump day4_scene1